#include <avr/io.h>
#include "Define/MACRO.H"
#include "Define/defConstant.h"
#include "Define/defStruct.h"
/****************************************************************/
/*
	инициализация гаммы процедуры шифрования и
	изменение фазы работы на значение 3.
*/
/****************************************************************/
extern struct descWork dw;				// структура - описатель фазы работы загрузчика
/****************************************************************/

void cryptInit(void)
{
	if(dw.phase != 2)	return;			//возврат по причине не фазы инициализации
	/*-----------------------------*/
	/*инициализация гаммы процедуры шифрования (шифрование не используется)*/
	dw.phase=3;
}

