/***********************************************************************************
  Основные процессорные установки и установки переменных
***********************************************************************************/
#include <avr/io.h>
#include <avr/boot.h>
#include <avr/wdt.h>
#include "Define/defConstant.h"
#include "Define/defStruct.h"
#include "Define/MACRO.H"

extern struct timer time;				// структура для поддержки мигания светодиода
extern unsigned char time_out[NT];	// массив для организации задержек

void initCPU(void)
{
	disable();
	DDRC = 0xFF; 
	DDRD = 0x80;
	DDRE = 0x0C;
	DDRF = 0x00;
	
	XMCRA =  (1<<SRE) | 0x05;			//установка одного цикла ожидения при обращении к внешней памяти
	
	TCCR0A = 0x05;						// установка прескайлера 1024.
	TCNT0 = 0;							//при таких установках, переполнение таймера будет происходить с частотой 6 000 000:(1024*256)=22,888Hz.
	
	time.current=DEL1000;
	time.init=DEL1000;
	time_out[0]=DEL1000;				//установка лимита времени ожидания коннекта с USB перед переходом в программу пользователя
	
	GREEN_ON();
	RED_OFF();
	
	wdt_enable(WDTO_1S);		// установка WDT на время 1с
	wdt_reset();				// сброс внутреннего сторожевого таймера
	EWDT_reset();				// сброс внешнего сторожевого таймера
}

