#include <avr/io.h>
#include <avr/boot.h>
#include "Define/defStruct.h"
/****************************************************************/
/*	
	Установка бит защиты, выдача собщения
*/
/****************************************************************/
extern struct descWork dw;			// структура - описатель фазы работы загрузчика
/****************************************************************/
/****************************************************************/
void resetState(unsigned char s);
void ansSuccess(void);			//выдача сообщения об успешном завершении программирования
/****************************************************************/
/****************************************************************/

void setLock(void)
{
	if(dw.phase != 4) return;			//возврат по причине отсутствия запроса на запись бит защиты
	/*-----------------------------*/
	boot_lock_bits_set (_BV(BLB12) | _BV(BLB11));	//установка бит защиты
	ansSuccess();						//выдача сообщения об успешном завершении программирования
	resetState(1);						//возврат к процедуре диалога
}
/*-----------------------------------------------*/

