#include <avr/io.h>
#include "Define/MACRO.H"
#include "Define/defConstant.h"
#include "Define/defStruct.h"
/****************************************************************/
/*
	при таких установках, переполнение таймера
	и установка флага переполнения будет происходить
	с частотой 6000000:(1024*256)=22,888Hz. 43,69ms
*/
/****************************************************************/
extern struct timer time;				// структурa для организации мигания индикатора режима работы
extern unsigned char time_out[NT];	// массив для организации задержек
/****************************************************************/

void timer(void)
{
	unsigned char i;
	i=(TIFR0 << 7);					//анализ флага переполнения таймера 0
	if(i)
	{	
		TIFR0 = 1;						//сброс флага переполнения
		if(--time.current == 0)
		{
			time.current=time.init;		//повторная инициализация
			GREEN_TOG();				//переключение светодиода работы
		}
		for(i=0; i<NT; i++)			//модификация таймерных переменных
		{
			if(time_out[i]) time_out[i]--;
		}	
	}
}

