
/****************************************************************************
  Определение основных констант программы
****************************************************************************/
/***************************************************************************/
#define NT					4        	// число переменных в массиве для организации задержек
#define USBB				16			//размер буфера приема и передачи USB
#define SL					64			//длина буфера для поля данных одной hex записи
#define PS					256			//длина буфера записи страницы
/****************************************************************************
 Определение констант для отработки временных задержек
****************************************************************************/
#define DEL2000				56        	// число тактов таймера для организации задержки 2с
#define DEL1000				28        	// число тактов таймера для организации задержки 1с
#define DEL750				21        	// число тактов таймера для организации задержки 750mс
#define DEL500				14        	// число тактов таймера для организации задержки 500 мс
#define DEL250				7        	// число тактов таймера для организации задержки 250 мс
#define DEL100				3        	// число тактов таймера для организации задержки 107мс
/***************************************************************************/
/***************************************************************************/


