/*
	Определение основных переменных, массивов и структур программы.
*/
#include <avr/io.h>
#include "Define/defConstant.h"
#include "Define/defStruct.h"
#include <avr/pgmspace.h>
#include <avr/boot.h>
/****************************************************************************
  Global structs definitions
****************************************************************************/
struct timer time;				//структура для работы с индикатором
struct Request rc;				//структура запроса на обработку входного пакета от USB
struct Request tx;				//структура запроса на передачу пакета в сторону USB
struct descWork dw;			//структура - описатель фазы работы загрузчика
/****************************************************************************
  Global variables definitions
****************************************************************************/
unsigned char time_out[NT];	//таймерные переменные с декрементом от переполнения
unsigned char rcBuff[USBB];	//буфер для приема из USB
unsigned char txBuff[USBB];	//буфер для передачи в USB
unsigned char dataFild[SL];	//буфер для накопления байтов из поля данных записи
unsigned char preparePage[PS];//буфер для страницы перед записью во Flash программ
unsigned char controlPage[PS];//буфер для контроля сравнением прочитанной Flash страницы после записи
/***************************************************************************/
/***************************************************************************/


