/****************************************************************************
  Описание основных структур программы
****************************************************************************/
#include "Define/defConstant.h"
#include <avr/boot.h>
#include <avr/pgmspace.h>
/*-------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------*/
struct Request
{	
	unsigned char		req;		// признак запроса передачи или обработки пакета
	unsigned char		len;		// длина запрошенного к передаче или обработке пакета
};
/*-------------------------------------------------------------------------*/
struct timer
{	
	unsigned char		current;	// текущее значение таймера декремента
	unsigned char		init;		// исходное значение таймера для инициализации
};
/*-------------------------------------------------------------------------*/
struct descWork					// структура - описатель фазы работы загрузчика
{
	unsigned char	phase;			// текущая фаза работы, главный селектор для работы функций
	/*-----------------------*/
	unsigned char	phDi;			// текущая фаза функции начального диалога с компьютером
	/*-----------------------*/
	unsigned char	phRecord;		// текущая фаза обработчика входных записей
	unsigned char	reqRecord;		// запрос на обработку записи с указанными параметрами ll, aaaa, tt.
	unsigned char	ll;				// длина поля данных полученной hex записи
	unsigned char	tt;				// значение поля типа записи полученной hex записи
	unsigned int	aaaa;			// значение поля адреса полученной hex записи
	/*-----------------------*/
	unsigned char	reqWRend;		// признак окончания записи всех страниц и требование выдачи сообщения
	unsigned char	reqWrite;		// признак запроса записи страницы
	/*-----------------------*/
	uint32_t		page;			// текущий адрес для сохранения байта данных
	uint32_t		dop;			// добавка к текущему адресу
	uint32_t		lim;			// предельный адрес для текущей страницы записи во Flash
};

