/**********************************************************************************
  Основные процессорные установки
**********************************************************************************/

#include <avr/io.h>
#include <avr/wdt.h>
#include "headers/MACRO.H"
/****************************************************************/

/****************************************************************/	
void initCPU(void)
{
	DDRC = 0xFF; 	
	DDRD = 0x80;
	DDRE = 0x0C;
	DDRF = 0x00;
	
	XMCRA = (1<<SRE) | 0x05;	//разрешение обращения к внешней памяти 1 wait-state 0x05
	
	TCCR0A = 0x05;				// установка прескайлера 1024.
	TIMSK0 = 1;					// Разрешение прерывания по переполнению
	TCNT0 = 0;
	
	wdt_enable(WDTO_1S);		// установка WDT на время 1с
	wdt_reset();				// сброс внутреннего сторожевого таймера
	WDText();					// сброс внешнего сторожевого таймера
}

