/****************************************************************************
  Определение размеров буферов приема-передачи и параметра настройки TWI
****************************************************************************/

#define ETH_RC_SIZE			40			// 40 Размер буфера данных пакета, который пришел по сети ethernet.
#define ETH_TR_SIZE			32			// 32 Размер буфера данных промежуточного хранения предназначенных для передачи по ethernet.
/****************************************************************************
  Параметры модуля Ethernet
****************************************************************************/
#define PMASK				0x1FFFul	// маска для указателей памяти модуля ethernet 0x1FFFul
#define FULLSIZE			0x2000		// размер доступной памяти модуля ethernet отдельно на запись и чтение 0x2000
/****************************************************************************
 Определение констант для отработки временных задержек
****************************************************************************/
#define NT					4       	// число переменных в массиве для организации задержек
#define MC500				30        	// число тактов таймера для организации задержки 500 мс
#define MC33				2        	// число тактов таймера для организации задержки ~33 мс
