/****************************************************************************
  ќпределение размеров буферов приема-передачи
****************************************************************************/
#define TWI_BUFFER_SIZE		48			// 40 Set this to the largest message size that will be sent including address byte.
#define ETH_RC_SIZE			40			// 40 –азмер буфера данных пакета, который пришел по сети ethernet.
#define ETH_TR_SIZE			32			// 32 –азмер буфера данных промежуточного хранени€ предназначенных дл€ передачи по ethernet.
/****************************************************************************
 ќпределение констант дл€ отработки временных задержек
****************************************************************************/
#define NT					4       	// число переменных в массиве дл€ организации задержек
#define MC500				30        	// число тактов таймера дл€ организации задержки 500 мс
#define MC33				2        	// число тактов таймера дл€ организации задержки ~33 мс
#define BLOCK_TWI_TIME		26			// число тактов таймера дл€ организации задержки ожидани€ готовности TWI 1 с
/****************************************************************************
   одировка адреса устройства и операции на шине TWI
****************************************************************************/
#define SLA_W				0x02		// SLA with write bit.  од адреса устройства TWI дл€ операции записи (адрес устройства установлен = 1)
#define SLA_R				0x03		// SLA with read bit.  од адреса устройства TWI дл€ операции чтени€ (адрес устройства установлен = 1)
/****************************************************************************/
#define TWI_BUSY			0xFF		// TWI Bus busy
#define TWI_FREE			0x00		// TWI Bus free
#define TWI_WRITE			0x01		// TWI Bus write compleat and free
#define TWI_READ			0x02		// TWI Bus read compleat and free
#define TWI_ERROR			0x03		// TWI Bus error and free
/***************************************************************************/
/****************************************************************************
  ѕараметры модул€ Ethernet
****************************************************************************/
#define PMASK				0x1FFFul	// маска дл€ указателей пам€ти модул€ ethernet 0x1FFFul
#define FULLSIZE			0x2000		// размер доступной пам€ти модул€ ethernet отдельно на запись и чтение 0x2000
/***************************************************************************/
/****************************************************************************
 ќпределение констант дл€ определени€ фатального сбо€
****************************************************************************/
/***************************************************************************/
#define MAX_ERROR			32			// максимально допустимое количество ошибок при обмене.
/***************************************************************************/
